<?php

declare(strict_types=1);

return [
    'location' => [
        'no_location_found' => 'प्रदान गरिएको छोटो कोडसँग मेल खाने कुनै रेकर्ड फेला परेन।',
        'ask_short' => 'स्थानको छोटो कोड (Short Code)',
        'ask_long' => 'स्थान विवरण (Description)',
        'created' => ':id आईडी सहित नयाँ स्थान (:name) सफलतापूर्वक सिर्जना गरियो।',
        'deleted' => 'अनुरोध गरिएको स्थान सफलतापूर्वक मेटाइयो।',
    ],
    'user' => [
        'search_users' => 'प्रयोगकर्ता नाम, प्रयोगकर्ता आईडी, वा इमेल ठेगाना प्रविष्ट गर्नुहोस्',
        'select_search_user' => 'मेटाउनुपर्ने प्रयोगकर्ताको आईडी (पुनः खोज्न \'0\' प्रविष्ट गर्नुहोस्)',
        'deleted' => 'प्रयोगकर्ता प्यानलबाट सफलतापूर्वक हटाइयो।',
        'confirm_delete' => 'के तपाईं पक्का यो प्रयोगकर्तालाई प्यानलबाट मेटाउन चाहनुहुन्छ?',
        'no_users_found' => 'प्रदान गरिएको खोज शब्दका लागि कुनै प्रयोगकर्ता फेला परेनन्।',
        'multiple_found' => 'प्रदान गरिएको प्रयोगकर्ताका लागि धेरै खाताहरू फेला परे, --no-interaction झण्डाका कारण प्रयोगकर्ता मेटाउन असमर्थ भयो।',
        'ask_admin' => 'के यो प्रयोगकर्ता प्रशासक (Administrator) हो?',
        'ask_email' => 'इमेल ठेगाना',
        'ask_username' => 'प्रयोगकर्ता नाम',
        'ask_name_first' => 'पहिलो नाम',
        'ask_name_last' => 'थर / पछिल्लो नाम',
        'ask_password' => 'पासवर्ड',
        'ask_password_tip' => 'यदि तपाईं प्रयोगकर्तालाई इमेल गरिएको अनियमित पासवर्ड सहितको खाता सिर्जना गर्न चाहनुहुन्छ भने, यो आदेश पुनः चलाउनुहोस् (CTRL+C) र `--no-password` झण्डा पास गर्नुहोस्।',
        'ask_password_help' => 'पासवर्ड कम्तीमा ८ वर्ण लामो हुनुपर्छ।',
        '2fa_help_text' => [
            'यदि प्रयोगकर्ताको खातामा २-चरण प्रमाणीकरण सक्षम छ भने यो आदेशले त्यसलाई अक्षम गर्नेछ। यदि प्रयोगकर्ता आफ्नो खाताबाट बाहिरिएको छ भने यो केवल खाता पुनः प्राप्त आदेशको रूपमा प्रयोग गर्नुपर्छ।',
            'यदि तपाईं यो गर्न चाहनुहुन्न भने, यो प्रक्रियाबाट बाहिर निस्कन CTRL+C थिच्नुहोस्।',
        ],
        '2fa_disabled' => ':email का लागि २-चरण प्रमाणीकरण अक्षम गरिएको छ।',
    ],
    'schedule' => [
        'output_line' => '`:schedule` (:hash) मा पहिलो कार्यका लागि काम पठाउँदै।',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'सेवा ब्याकअप फाइल :file मेटाउँदै।',
    ],
    'server' => [
        'rebuild_failed' => 'नोड ":node" मा ":name" (#:id) का लागि पुनः निर्माण अनुरोध त्रुटिका साथ असफल भयो: :message',
        'reinstall' => [
            'failed' => 'नोड ":node" मा ":name" (#:id) का लागि पुनः स्थापना अनुरोध त्रुटिका साथ असफल भयो: :message',
            'confirm' => 'तपाईं सर्भरहरूको समूहमा पुनः स्थापना गर्न लाग्नुभएको छ। के तपाईं जारी राख्न चाहनुहुन्छ?',
        ],
        'power' => [
            'confirm' => 'तपाईं :count सर्भरहरूमा :action कार्य गर्न लाग्नुभएको छ। के तपाईं जारी राख्न चाहनुहुन्छ?',
            'action_failed' => 'नोड ":node" मा ":name" (#:id) का लागि पावर कार्य अनुरोध त्रुटिका साथ असफल भयो: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP होस्ट (उदा. smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP पोर्ट',
            'ask_smtp_username' => 'SMTP प्रयोगकर्ता नाम',
            'ask_smtp_password' => 'SMTP पासवर्ड',
            'ask_mailgun_domain' => 'Mailgun डोमेन',
            'ask_mailgun_endpoint' => 'Mailgun अन्तिम विन्दु (Endpoint)',
            'ask_mailgun_secret' => 'Mailgun गोप्य साँचो (Secret)',
            'ask_mandrill_secret' => 'Mandrill गोप्य साँचो (Secret)',
            'ask_postmark_username' => 'Postmark API कुञ्जी',
            'ask_driver' => 'इमेल पठाउन कुन ड्राइभर प्रयोग गर्नुपर्छ?',
            'ask_mail_from' => 'इमेल पठाउने इमेल ठेगाना',
            'ask_mail_name' => 'इमेल देखिने नाम',
            'ask_encryption' => 'प्रयोग गरिने इन्क्रिप्सन विधि',
        ],
    ],
];

