<?php

declare(strict_types=1);

return [
    'email' => [
        'title' => 'तपाईंको इमेल अद्यावधिक गर्नुहोस्',
        'updated' => 'तपाईंको इमेल ठेगाना अद्यावधिक गरिएको छ।',
    ],
    'password' => [
        'title' => 'तपाईंको पासवर्ड परिवर्तन गर्नुहोस्',
        'requirements' => 'तपाईंको नयाँ पासवर्ड कम्तीमा ८ वर्ण लामो हुनुपर्छ।',
        'updated' => 'तपाईंको पासवर्ड अद्यावधिक गरिएको छ।',
    ],
    'two_factor' => [
        'button' => '२-चरण प्रमाणीकरण कन्फिगर गर्नुहोस्',
        'disabled' => 'तपाईंको खातामा २-चरण प्रमाणीकरण अक्षम गरिएको छ। अब उप्रान्त लगइन गर्दा तपाईंलाई टोकन सोधिने छैन।',
        'enabled' => 'तपाईंको खातामा २-चरण प्रमाणीकरण सक्षम गरिएको छ! अब उप्रान्त, लगइन गर्दा तपाईंले आफ्नो यन्त्रद्वारा उत्पन्न कोड प्रदान गर्नुपर्नेछ।',
        'invalid' => 'प्रदान गरिएको टोकन अमान्य थियो।',
        'setup' => [
            'title' => '२-चरण प्रमाणीकरण सेटअप गर्नुहोस्',
            'help' => 'कोड स्क्यान गर्न असमर्थ हुनुहुन्छ? तलको कोड आफ्नो अनुप्रयोगमा प्रविष्ट गर्नुहोस्:',
            'field' => 'टोकन प्रविष्ट गर्नुहोस्',
        ],
        'disable' => [
            'title' => '२-चरण प्रमाणीकरण अक्षम गर्नुहोस्',
            'field' => 'टोकन प्रविष्ट गर्नुहोस्',
        ],
    ],
];

