<?php

declare(strict_types=1);

return [
    'permissions' => [
        'websocket_*' => 'यो सर्भरका लागि वेबसकेटमा पहुँचको अनुमति दिन्छ।',
        'control_console' => 'प्रयोगकर्तालाई सर्भर कन्सोलमा डेटा पठाउन अनुमति दिन्छ।',
        'control_start' => 'प्रयोगकर्तालाई सर्भर सुरु (Start) गर्न अनुमति दिन्छ।',
        'control_stop' => 'प्रयोगकर्तालाई सर्भर बन्द (Stop) गर्न अनुमति दिन्छ।',
        'control_restart' => 'प्रयोगकर्तालाई सर्भर पुनः सुरु (Restart) गर्न अनुमति दिन्छ।',
        'control_kill' => 'प्रयोगकर्तालाई सर्भर जबरजस्ती बन्द (Kill) गर्न अनुमति दिन्छ।',
        'user_create' => 'प्रयोगकर्तालाई सर्भरका लागि नयाँ प्रयोगकर्ता खाताहरू सिर्जना गर्न अनुमति दिन्छ।',
        'user_read' => 'प्रयोगकर्तालाई यस सर्भरसँग सम्बन्धित प्रयोगकर्ताहरू हेर्न अनुमति दिन्छ।',
        'user_update' => 'प्रयोगकर्तालाई यस सर्भरसँग सम्बन्धित अन्य प्रयोगकर्ताहरू परिमार्जन गर्न अनुमति दिन्छ।',
        'user_delete' => 'प्रयोगकर्तालाई यस सर्भरसँग सम्बन्धित अन्य प्रयोगकर्ताहरू मेटाउन अनुमति दिन्छ।',
        'file_create' => 'प्रयोगकर्तालाई नयाँ फाइल र डाइरेक्टरीहरू सिर्जना गर्न अनुमति दिन्छ।',
        'file_read' => 'प्रयोगकर्तालाई यस सर्भरसँग सम्बन्धित फाइल र फोल्डरहरू हेर्न, साथै तिनीहरूको सामग्री हेर्न अनुमति दिन्छ।',
        'file_update' => 'प्रयोगकर्तालाई सर्भरसँग सम्बन्धित फाइल र फोल्डरहरू अद्यावधिक गर्न अनुमति दिन्छ।',
        'file_delete' => 'प्रयोगकर्तालाई फाइल र डाइरेक्टरीहरू मेटाउन अनुमति दिन्छ।',
        'file_archive' => 'प्रयोगकर्तालाई फाइल अर्काइभहरू सिर्जना गर्न र अवस्थित अर्काइभहरू अनजिप (Decompress) गर्न अनुमति दिन्छ।',
        'file_sftp' => 'प्रयोगकर्तालाई SFTP क्लाइन्ट प्रयोग गरी माथिका फाइल कार्यहरू गर्न अनुमति दिन्छ।',
        'allocation_read' => 'सर्भर बाँडफाँड (Allocation) व्यवस्थापन पृष्ठहरूमा पहुँच गर्न अनुमति दिन्छ।',
        'allocation_update' => 'प्रयोगकर्तालाई सर्भरको बाँडफाँड परिमार्जन गर्न अनुमति दिन्छ।',
        'database_create' => 'प्रयोगकर्तालाई सर्भरका लागि नयाँ डाटाबेस सिर्जना गर्न अनुमति दिन्छ।',
        'database_read' => 'प्रयोगकर्तालाई सर्भर डाटाबेसहरू हेर्न अनुमति दिन्छ।',
        'database_update' => 'प्रयोगकर्तालाई डाटाबेस परिमार्जन गर्न अनुमति दिन्छ। यदि प्रयोगकर्तासँग "पासवर्ड हेर्नुहोस्" अनुमति छैन भने पासवर्ड परिमार्जन गर्न सकिने छैन।',
        'database_delete' => 'प्रयोगकर्तालाई डाटाबेस उदाहरण मेटाउन अनुमति दिन्छ।',
        'database_view_password' => 'प्रयोगकर्तालाई प्रणालीमा डाटाबेस पासवर्ड हेर्न अनुमति दिन्छ।',
        'schedule_create' => 'प्रयोगकर्तालाई सर्भरका लागि नयाँ कार्यतालिका (Schedule) सिर्जना गर्न अनुमति दिन्छ।',
        'schedule_read' => 'प्रयोगकर्तालाई सर्भरका कार्यतालिकाहरू हेर्न अनुमति दिन्छ।',
        'schedule_update' => 'प्रयोगकर्तालाई अवस्थित सर्भर कार्यतालिका परिमार्जन गर्न अनुमति दिन्छ।',
        'schedule_delete' => 'प्रयोगकर्तालाई सर्भरको कार्यतालिका मेटाउन अनुमति दिन्छ।',
    ],
];

