<?php

declare(strict_types=1);

return [
    'validation' => [
        'fqdn_not_resolvable' => 'प्रदान गरिएको FQDN वा आईपी ठेगाना मान्य आईपी ठेगानामा रूपान्तरण हुन सक्दैन।',
        'fqdn_required_for_ssl' => 'यो नोडका लागि SSL प्रयोग गर्न सार्वजनिक आईपी ठेगानामा रूपान्तरण हुने पूर्ण योग्य डोमेन नाम (FQDN) आवश्यक पर्दछ।',
    ],
    'notices' => [
        'allocations_added' => 'यस नोडमा बाँडफाँडहरू (Allocations) सफलतापूर्वक थपिएका छन्।',
        'node_deleted' => 'नोड प्यानलबाट सफलतापूर्वक हटाइएको छ।',
        'location_required' => 'तपाईंले यो प्यानलमा नोड थप्नु अघि कम्तीमा एउटा स्थान (Location) कन्फिगर गरेको हुनुपर्छ।',
        'node_created' => 'नयाँ नोड सफलतापूर्वक सिर्जना गरियो। तपाईंले \'कन्फिगरेसन\' ट्याबमा गएर यस मेसिनमा डेमन स्वचालित रूपमा कन्फिगर गर्न सक्नुहुन्छ। कुनै पनि सर्भर थप्न अघि तपाईंले कम्तीमा एउटा आईपी ठेगाना र पोर्ट बाँडफाँड गर्नुपर्छ।',
        'node_updated' => 'नोड जानकारी अद्यावधिक गरिएको छ। यदि कुनै डेमन सेटिङहरू परिवर्तन गरिएको छ भने ती प्रभावकारी हुन तपाईंले यसलाई पुनः सुरु गर्नुपर्नेछ।',
        'unallocated_deleted' => '<code>:ip</code> का लागि सबै बाँडफाँड नगरिएका पोर्टहरू मेटाइएका छन्।',
    ],
];

