<?php

declare(strict_types=1);

return [
    'exceptions' => [
        'no_new_default_allocation' => 'तपाईं यो सर्भरका लागि पूर्वनिर्धारित बाँडफाँड (Allocation) मेटाउने प्रयास गर्दै हुनुहुन्छ तर प्रयोग गर्नका लागि कुनै वैकल्पिक बाँडफाँड छैन।',
        'skipping_install_script' => 'यो सर्भर यसको एग (Egg) को स्थापना लिपि (Install Script) छोड्न कन्फिगर गरिएको छ। त्यो सेटिङ अक्षम नगरेसम्म पुनः स्थापना उपलब्ध छैन।',
        'marked_as_failed' => 'यो सर्भर अघिल्लो स्थापना असफल भएको भनी चिन्हित गरिएको थियो। यो अवस्थामा हालको स्थिति टगल गर्न सकिँदैन।',
        'bad_variable' => ':name चर (Variable) मा प्रमाणीकरण त्रुटि देखा पर्यो।',
        'daemon_exception' => 'डेमनसँग सञ्चार गर्ने प्रयास गर्दा HTTP/:code प्रतिक्रिया कोड सहितको अपवाद देखा पर्यो। यो अपवाद लग गरिएको छ। (अनुरोध आईडी: :request_id)',
        'default_allocation_not_found' => 'अनुरोध गरिएको पूर्वनिर्धारित बाँडफाँड यस सर्भरका बाँडफाँडहरूमा फेला परेन।',
    ],
    'alerts' => [
        'startup_changed' => 'यस सर्भरका लागि स्टार्टअप कन्फिगरेसन अद्यावधिक गरिएको छ। यदि यस सर्भरको नेस्ट वा एग परिवर्तन गरिएको भए अहिले पुनः स्थापना हुनेछ।',
        'server_deleted' => 'सर्भर प्रणालीबाट सफलतापूर्वक हटाइएको छ।',
        'server_created' => 'सर्भर प्यानलमा सफलतापूर्वक सिर्जना गरियो। कृपया यो सर्भर पूर्ण रूपमा स्थापना गर्न डेमनलाई केही मिनेट दिनुहोस्।',
        'build_updated' => 'यस सर्भरका लागि निर्माण (Build) विवरणहरू अद्यावधिक गरिएको छ। केही परिवर्तनहरू लागू हुन पुनः सुरु गर्न आवश्यक हुन सक्छ।',
        'suspension_toggled' => 'सर्भर निलम्बन स्थिति :status मा परिवर्तन गरिएको छ।',
        'rebuild_on_boot' => 'यो सर्भर डकर कन्टेनर पुनः निर्माण आवश्यक पर्ने रूपमा चिन्हित गरिएको छ। यो अर्को पटक सर्भर सुरु हुँदा हुनेछ।',
        'install_toggled' => 'यस सर्भरको स्थापना स्थिति टगल गरिएको छ।',
        'server_reinstalled' => 'यो सर्भर अब तुरुन्तै सुरु हुने गरी पुनः स्थापनाका लागि लामबद्ध (Queued) गरिएको छ।',
        'details_updated' => 'सर्भर विवरणहरू सफलतापूर्वक अद्यावधिक गरियो।',
        'docker_image_updated' => 'यस सर्भरका लागि प्रयोग गरिने पूर्वनिर्धारित डकर छवि सफलतापूर्वक परिवर्तन गरियो। यो परिवर्तन लागू गर्न पुनः सुरु आवश्यक छ।',
        'node_required' => 'तपाईंले यो प्यानलमा सर्भर थप्न अघि कम्तीमा एउटा नोड कन्फिगर गरेको हुनुपर्छ।',
        'transfer_nodes_required' => 'सर्भर स्थानान्तरण गर्न अघि तपाईंले कम्तीमा दुईवटा नोडहरू कन्फिगर गरेको हुनुपर्छ।',
        'transfer_started' => 'सर्भर स्थानान्तरण सुरु गरिएको छ।',
        'transfer_not_viable' => 'तपाईंले चयन गर्नुभएको नोडमा यो सर्भर समायोजन गर्न आवश्यक डिस्क स्पेस वा मेमोरी उपलब्ध छैन।',
    ],
];

