<?php

declare(strict_types=1);

return [
    'daemon_connection_failed' => 'डेमनसँग सञ्चार गर्ने प्रयास गर्दा HTTP/:code प्रतिक्रिया कोड सहितको अपवाद देखा पर्यो। यो अपवाद लग गरिएको छ।',
    'node' => [
        'servers_attached' => 'नोड मेटाउनका लागि त्यसमा कुनै पनि सर्भर लिङ्क गरिएको हुनु हुँदैन।',
        'daemon_off_config_updated' => 'डेमन कन्फिगरेसन अद्यावधिक गरिएको छ, यद्यपि डेमनमा कन्फिगरेसन फाइल स्वचालित रूपमा अद्यावधिक गर्ने प्रयास गर्दा त्रुटि देखा पर्यो। यी परिवर्तनहरू लागू गर्न तपाईंले डेमनका लागि कन्फिगरेसन फाइल (config.yml) म्यानुअल रूपमा अद्यावधिक गर्नुपर्नेछ।',
    ],
    'allocations' => [
        'server_using' => 'हाल यस बाँडफाँडमा एउटा सर्भर तोकिएको छ। कुनै सर्भर तोकिएको नभएमा मात्र बाँडफाँड मेटाउन सकिन्छ।',
        'too_many_ports' => 'एकै पटक एउटै दायरामा १००० भन्दा बढी पोर्टहरू थप्न समर्थित छैन।',
        'invalid_mapping' => ':port का लागि प्रदान गरिएको म्यापिङ अमान्य थियो र प्रक्रिया गर्न सकिएन।',
        'cidr_out_of_range' => 'CIDR संकेतनले /25 र /32 बीचका मास्कहरूलाई मात्र अनुमति दिन्छ।',
        'port_out_of_range' => 'बाँडफाँडमा पोर्टहरू १०२४ भन्दा ठूलो र ६५५३५ भन्दा सानो वा बराबर हुनुपर्छ।',
    ],
    'egg' => [
        'delete_has_servers' => 'प्यानलबाट सक्रिय सर्भरहरू संलग्न भएको एग (Egg) मेटाउन सकिँदैन।',
        'invalid_copy_id' => 'लिपि प्रतिलिपि गर्न चयन गरिएको एग या त अवस्थित छैन, वा आफैँ अर्को लिपि प्रतिलिपि गर्दैछ।',
        'has_children' => 'यो एग एक वा बढी अन्य एगहरूको अभिभावक हो। कृपया यो एग मेटाउनु अघि ती एगहरू मेटाउनुहोस्।',
        'variables' => [
            'reserved_name' => 'वातावरण चर (Environment variable) :name सुरक्षित छ र चरको रूपमा तोक्न सकिँदैन।',
            'bad_validation_rule' => 'प्रमाणीकरण नियम ":rule" यस अनुप्रयोगका लागि मान्य नियम होइन।',
        ],
        'importer' => [
            'json_error' => 'JSON फाइल पार्स गर्ने प्रयास गर्दा त्रुटि देखा पर्यो: :error.',
            'file_error' => 'प्रदान गरिएको JSON फाइल मान्य थिएन।',
            'invalid_json_provided' => 'प्रदान गरिएको JSON फाइल पहिचान गर्न सकिने ढाँचामा छैन।',
        ],
    ],
    'subusers' => [
        'editing_self' => 'आफ्नै उप-प्रयोगकर्ता खाता सम्पादन गर्न अनुमति छैन।',
        'user_is_owner' => 'तपाईं यस सर्भरका लागि सर्भर मालिकलाई उप-प्रयोगकर्ताको रूपमा थप्न सक्नुहुन्न।',
        'subuser_exists' => 'त्यो इमेल ठेगाना भएको प्रयोगकर्ता पहिले नै यस सर्भरको उप-प्रयोगकर्ताको रूपमा तोकिएको छ।',
    ],
    'databases' => [
        'delete_has_databases' => 'सक्रिय डाटाबेसहरू लिङ्क भएको डाटाबेस होस्ट सर्भर मेटाउन सकिँदैन।',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'श्रृंखलाबद्ध कार्य (Chained task) का लागि अधिकतम अन्तराल समय १५ मिनेट हो।',
    ],
    'locations' => [
        'has_nodes' => 'सक्रिय नोडहरू संलग्न भएको स्थान मेटाउन सकिँदैन।',
    ],
    'users' => [
        'node_revocation_failed' => '<a href=":link">नोड #:node</a> मा कुञ्जीहरू खारेज गर्न असफल भयो। :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'स्वचालित डिप्लोयमेन्टका लागि तोकिएका आवश्यकताहरू पूरा गर्ने कुनै नोडहरू फेला परेनन्।',
        'no_viable_allocations' => 'स्वचालित डिप्लोयमेन्टका आवश्यकताहरू पूरा गर्ने कुनै बाँडफाँडहरू फेला परेनन्।',
    ],
    'api' => [
        'resource_not_found' => 'अनुरोध गरिएको स्रोत यस सर्भरमा अवस्थित छैन।',
    ],
];

